import config

NAME = "NEAR"

sleepTime = 2
cancel_order_time = sleepTime * 0.98

"""
orders_num：档位起止数量 【初始档位，终止档位】
"""
orders_num = [1, 10]
# 扩展订单，配置需要增加的量
base_extend_num = {
    "BTC-USDT": 3,
    "ETH-USDT": 3,
    "EOS-USDT": 3,
    "1INCH-USDT": 3,
    "ALGO-USDT": 3,
    'DASH-USDT': 3,
    'TRX-USDT': 3,
    'XRP-USDT': 3,
    'LTC-USDT': 3,
}

# 拆分下单撤单数，0为不拆分 如果设置为0.5, 15单 会拆分为7+7+1
percent_order = 0.6


SPEC_SLEEP_TIME = {
    "BTC-USDT": 2,
}

account = config.near_strategy_account


RESET_TIMES = 1000

SPEC_SYMBOL_LIQUIDITY = {
    "USDQ": {
        1: (150,),
        2: (300,),
        3: (1000,),
        4: (2000,),
        5: (1000,),
        6: (10000,),
        7: (4800,),
        8: (11000,),

    },
    "USDR": {
        1: (8000,),
        2: (1000,),
        3: (300,),
        4: (100,),
        5: (700,),
        6: (200,),
        7: (120,),
        8: (10000,),
    },
    "EURR": {
        1: (100,),
        2: (800,),
        3: (1500,),
        4: (500,),
        5: (300,),
        6: (800,),
        7: (120,),
        8: (18000,),
    },
    "EURQ": {
        1: (20,),
        2: (15,),
        3: (150,),
        4: (80,),
        5: (300,),
        6: (80,),
        7: (1500,),
        8: (18000,),
    },
    "USDC": {
        1: (200000,),
        2: (80000,),
        3: (1010000,),
        4: (50000,),
        5: (300000,),
        6: (150000,),
        7: (200000,),
        8: (100000,),
    },
}
